app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."name" ASC
---
  def index
    @tasks = Task.all.order(:name)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    id = params[:id].to_i
   @task = Task.find_by(id: id)

INSERT INTO "tasks" ("name", "description", "completiondate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Gym"], ["description", "Take bus to gym"], ["completiondate", "6/9/19"], ["created_at", "2018-09-19 22:16:24.763112"], ["updated_at", "2018-09-19 22:16:24.763112"]]
---
    def create
      @task = Task.new(name: params[:task][:name], description: params[:task][:description], completiondate: params[:task][:completiondate])
      if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def edit
      @task = Task.find(params[:id].to_i)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "name" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["description", "DRIVE"], ["name", "[\"Gym\", \"DRIVE\", \"6/9/19\"]"], ["updated_at", "2018-09-19 22:53:24.934686"], ["id", 7]]
---
    def update
      @task = Task.find_by(id: params[:id].to_i)
      @task.name =  params[:task][:name]
      @task.description = params[:task][:description]
      @task.completiondate =  params[:task][:completiondate]
      if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "tasks" SET "completiondate" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completiondate", "2018-09-20 10:08:16 -0700"], ["updated_at", "2018-09-20 17:08:16.196743"], ["id", 12]]
---
      task = Task.find(params[:id])
      task.completiondate = Time.now
      task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "tasks" SET "completiondate" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completiondate", nil], ["updated_at", "2018-09-20 21:10:10.044502"], ["id", 15]]
---
      task = Task.find(params[:id])
      task.completiondate = nil
      task.save